Dalam chapter sebelumnya kita sudah mempelajari mengenai perbedaan antara pandas dengan series. Pada chapter kali ini kita akan mendalami penggunaan pandas dalam memanipulasi sebuah dataset, dengan menggunakan dataset publik.

In [1]:
#import packages
import pandas as pd

In [ ]:
df = pd.read_csv("")

In [3]:
# read dataset 
df = pd.read_csv("/Users/jojomac/introduction_python/dataset/sales data-set.csv")

In [4]:
#1. head
#head digunakan untuk mengambil 5 data teratas dari dataset kita 
df.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [7]:
df.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [8]:
#tail digunakan untuk mengambil 5 data terbawah 
df.tail()

        Store  Dept        Date  Weekly_Sales  IsHoliday
421565     45    98  28/09/2012        508.37      False
421566     45    98  05/10/2012        628.10      False
421567     45    98  12/10/2012       1061.02      False
421568     45    98  19/10/2012        760.01      False
421569     45    98  26/10/2012       1076.80      False

In [9]:
df.tail(10)

        Store  Dept        Date  Weekly_Sales  IsHoliday
421560     45    98  24/08/2012        415.40      False
421561     45    98  31/08/2012        346.04      False
421562     45    98  07/09/2012        352.44       True
421563     45    98  14/09/2012        605.96      False
421564     45    98  21/09/2012        467.30      False
421565     45    98  28/09/2012        508.37      False
421566     45    98  05/10/2012        628.10      False
421567     45    98  12/10/2012       1061.02      False
421568     45    98  19/10/2012        760.01      False
421569     45    98  26/10/2012       1076.80      False

In [10]:
#2.shape
#shape digunakan untuk menampilkan dimensi pada data 
df.shape

(421570, 5)

In [11]:
#3. info 
#info digunakan untuk mengecek informasi terkait data
df.info

<bound method DataFrame.info of         Store  Dept        Date  Weekly_Sales  IsHoliday
0           1     1  05/02/2010      24924.50      False
1           1     1  12/02/2010      46039.49       True
2           1     1  19/02/2010      41595.55      False
3           1     1  26/02/2010      19403.54      False
4           1     1  05/03/2010      21827.90      False
...       ...   ...         ...           ...        ...
421565     45    98  28/09/2012        508.37      False
421566     45    98  05/10/2012        628.10      False
421567     45    98  12/10/2012       1061.02      False
421568     45    98  19/10/2012        760.01      False
421569     45    98  26/10/2012       1076.80      False

[421570 rows x 5 columns]>

In [ ]:
#4. column
# untuk menampilkan list kolom kolom apa saja yang kita miliki
df.columns

In [12]:
df.columns

Index(['Store', 'Dept', 'Date', 'Weekly_Sales', 'IsHoliday'], dtype='object')

In [13]:
column = df.columns

In [14]:
column

Index(['Store', 'Dept', 'Date', 'Weekly_Sales', 'IsHoliday'], dtype='object')

In [15]:
for i in column :
    print(i, type(i))

Store <class 'str'>
Dept <class 'str'>
Date <class 'str'>
Weekly_Sales <class 'str'>
IsHoliday <class 'str'>

Dari keterangan tipe data diatas bahwa semua tipa data adalah string. Oleh sebab itu kita perlu mengganti tipe data dari Date

In [ ]:
# 5. to datetime 
# mengganti tipe data ke datetime 
df['Date'] = pd.to_datetime(df['Date'], format='%d/%m/%Y')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  datetime64[ns]
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(2)
memory usage: 13.3 MB

In [20]:
type(df['Date'])

pandas.core.series.Series

In [17]:
for i in column :
    print(i, type(i))

Store <class 'str'>
Dept <class 'str'>
Date <class 'str'>
Weekly_Sales <class 'str'>
IsHoliday <class 'str'>

In [ ]:
# filtering 
start_date = pd.to_datetime('01/09/2012')

filtered_df = df.loc[df['Date'] >= start_date]

In [ ]:
filtered_df

## Groupby

Groupby merupakan salah satu keyword yang akan sering kita gunakan, karena dapat berfungsi untuk mengelompokkan data sesuai kebutuhan kita

In [ ]:
df.groupby(['Date','Weekly_Sales']).sum()

## Rename
Rename berguna untuk mengubah nama kolom yang kita miliki

In [ ]:
df.rename(columns={
    'Store':'Toko',
    'Dept' : 'Departemen', 
    'Date':'Tahun' 
    
})

Kolom berhasil diganti